<?php
// 1부터 10까지 숫자를 출력
// for($i = 1; $i <=10; $i++){
// 	echo $i, "\n";
// }

// 구구단 2단
// for($i = 1; $i <= 9; $i++){
// 	echo "2 X {$i} = ", 2*$i, "\n";
// }

// 구구단 1~9단
// for($i = 1; $i <= 9; $i++){
// 	echo "{$i}단\n";
// 	for($j = 1; $j <= 9; $j++){
// 		$mul = $i * $j;
// 		echo "{$i} X {$j} = {$mul}\n";
// 	}
// } 

// 2~8단은 출력 X
// for($i = 1; $i <= 9; $i++){
// 	if($i >= 2 && $i <= 8){
// 		continue;
// 	}
// 	echo "{$i}단\n";
// 	for($j = 1; $j <= 9; $j++){
// 		$mul = $i * $j;
// 		echo "{$i} X {$j} = {$mul}\n";
// 	}
// } 

// 짝수단만 출력
for($i = 1; $i <= 9; $i++){
	if($i % 2 == 0){
		echo "{$i}단\n";
		for($j = 1; $j <= 9; $j++){
			$mul = $i * $j;
			echo "{$i} X {$j} = {$mul}\n";
		}
	}
} 



?>